
''' 1 Арифметичні операції:
 Написати програму, яка зчитує два числа та виводить їхню суму, різницю, добуток та частку.'''
#
#num = 25
#num2 = 5
#
#print(num + num2)
#print(num - num2)
#print(num * num2)
#print(num / num2)
#
#
''' 2 Залишок від ділення:
 Користувач вводить два числа. Вивести залишок від ділення першого числа на друге.'''
#
#num = int(input("Enter number "))
#num2 = int(input("Enter number "))
#
#print(num % num2)
#
''' 3 Цілочисельне ділення:
 Користувач вводить два числа. Вивести, скільки разів перше число ділиться на друге без залишку.'''
#
#num = int(input("Enter number "))
#num2 = int(input("Enter number "))
#
#print(num // num2)
#
''' 4 Перетворення стрічки у число:
 Користувач вводить рядок, який складається з цифр. Програма повинна перетворити його на число та вивести.'''
#
#num = input("Enter number ")
#num2 = int(num)
#
#print(num2)

''' 5 Стрічкова конкатенація + математика:
 Користувач вводить два числа. Програма повинна вивести два прінти: перший — їхню суму,
 другий об'єднати їх. Якщо в нас числа 5 та 4, то результат повинен бути 9 та 54.'''
#
#num = input(int("Enter number "))  '''Не зовсім зрозумів що занчити "об'єднати їх" і як вийшло чило 54'''
#num2 = input(int("Enter number "))
#num3 = num + num2
#
#print(num + num2)
#print(num + num2 + num3)
#
#
''' 6 Вік користувача:
 Запитати у користувача його рік народження, ім'я та який зараз рік (три змінні)
 та вивести на екран два прінти: ім'я та скільки років користувачу. '''
#
#year_of_birth = input("Enter your year of birth ")
#name = input("Enter your name ")
#year_now = input("Enter what is the year now ")
#num = int(year_of_birth)
#num2 = int(year_now)
#
#print("User name is", name)
#print("User is", num2-num, "years old")
#
#
''' 7 Перевод з цельсія в фаренгейт:
 Напишіть програму, яка запитує в користувача кількість градусів в цельсіях і повертає в фаренгейтах. '''
#
#deg = int(input("Enter values in degrees Celsius "))
#
#print("Degrees in Fahrenheit ", deg*1.8 + 32)
#
#
''' 8 Перевод з фаренгейта в цельсій:
Напишіть програму, яка запитує в користувача кількість градусів в фаренгейтах і повертає в цельсіях.
Вам може здатися, що ця задача така ж, як попередня, але будьте уважні і перевірте результат вручну. '''
#
#deg = int(input("Enter values in degrees Fahrenheit "))
#
#print("Degrees in Celsius ", (deg-32) / 1.8)
#
#'''Знайшов найпростішу формулу тому не виникло проблем'''
#
''' 9 Теорема Піфагора:
 Запитайте у користувача довжини катетів та виведіть на екран довжину гіпотенузи.
 Трикутник рівнобедрений. Що б взвести в степінь ставимо два рази множення
 два в степені три буде так 2**3, квадратний корінь з двух буде 2**(1/2) '''
#
#numA = int(input("Enter number "))
#numB = int(input("Enter number "))
#num_C2 = numA ** 2 + numB ** 2
#numC = num_C2 ** (1/2)
#
#print(numC)
#
#
''' 10 Школярі та яблука
 n школярів ділять k яблук порівну, недільний залишок залишається в кошику.
 Скільки яблук дістанеться кожному школярові та скільки залишиться в кошику?
 Програма отримує на вхід числа n і k - цілі, додатні, не перевищують 10000.'''
#
#numN = int(input("Кількість школярів "))
#numK = int(input("Кількість яблук "))
#num = numK // numN
#num2 = numK % numN
#
#print("Школяри отрумають по", num, "залишається в кошику", num2)
#
#
''' 11 Магазин канцелярських товарів
 Одного разу, відвідавши магазин канцелярських товарів, Вася купив X олівців, Y ручок та Z фломастерів. Відомо,
 що ціна ручки на 2 гривні більше ціни олівця та на 7 гривень менше ціни фломастера. Також відомо,
 що вартість олівця становить 3 гривні. Потрібно визначити загальну вартість покупки.
 Вхідні дані
 просимо користувача ввести три змінні
 кожне з яких не перевищує 109.
 Вихідні дані
 виведіть одне ціле число – вартість покупки в гривнях.
 приклад для перевірки програми 1
 ввів: 1 1 1
 отримав: 20 '''
#
#numX = int(input("Кількість олівців "))
#numY = int(input("Кількість ручок "))
#numZ = int(input("Кількість фломастерів "))
#
#priceX = 3 * numX
#priceY = (priceX + 2) * numY
#priceZ = (priceY + 7) * numZ
#
#print("Загальну вартість покупки = ", priceX + priceY + priceZ)