'''Задача 1

Напишіть программу "Касир в кінотеватрі",
яка попросить користувача ввести свій вік (можна використати константу або функцію input(),
на екран має бути виведено лише одне повідомлення).
якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
якщо від 16 до 65 то зробіть якесь вітальне повідомлення, на ваш розсуд.
якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!" '''
#
#age = int(input("Введіть свій вік "))
#
#if age < 7:
#    print("Де твої батьки?")
#elif age < 17:
#    print("Це фільм для дорослих!")
#elif age > 65:
#    print("Покажіть пенсійне посвідчення!")
#else:
#    print("Приемного перегляду")
#
#
'''Задача 2
Текстова в чому різниця між is та ==? '''
#
#  == оператор перевіряє рівність значень двох об'єктів
# is оператор перевіряє ідентичність об'єктів а саме що змінні вказують на той самий об'єкт у пам'яті
#
'''Задача 3
Напишіть програму яка в користувача запитує два числа(можуть бути числа типу інт, а можуть бути в стр).
Потім запитує це стр чи інт і в залежності від відповіді конкатенує їх або додає і повертає результат перемножений на три.
якщо після конкатенації отримали 10 то перемноживши на 3 отримаємо 30. '''


var_1 = input("Введіть число ")
var_2 = input("Введіть число ")

variant = input("Введіть 'int' або 'str' ")

if variant == "int":
    print((int(var_1) * int(var_2)) * 3)
elif variant == "str":
    print((var_1 + var_2) * 3)
