'''Створіть два файли в 1-му напишіть такі функції:
1) сортування списка по зростанню числа, від меншого до більшого. Функція приймає список з чисел і повертає відсортований список.
2) сортування списка на спад, від  більшого до меншого. Функція приймає список з чисел і повертає відсортований список.
3) сортування за кількістю букв у слові. Функція приймає список з слів і повертає відсортований список. '''


def sorted_list(list):
    return sorted(list)

#1)сортування списка
print(sorted_list([200, 3, 4, 6, 70, 1, 3, 44]))
#  ще так зробив, тут легше редагувати числа в лісті
numbers = [200, 3, 4, 6, 70, 1, 3, 44] # приймае
sorted_nuber = sorted_list(numbers)
print(sorted_nuber)  # повертае [1, 3, 3, 4, 6, 44, 70, 200]

#2)від  більшого до меншого
def sorted_list_revers(list):
    return sorted(list, reverse=True)

#також два варіанта
numbers_revers = [200, 300, 45, 60, 70, 1, 3, 44] # приймае
sorted_nuber2 = sorted_list_revers(numbers_revers)
print(sorted_nuber2) # повертае [300, 200, 70, 60, 45, 44, 3, 1]

print(sorted_list_revers([200, 300, 45, 60, 70, 1, 3, 44]))

#3)сортування за кількістю букв у слові
def sorted_list_words(list):
    return sorted(list, key=len)

words = ['яблука', 'банани', 'ківі', 'кавун', 'хліб'] # приймае
sorted_words = sorted_list_words(words)
print(sorted_words) # повертае ['ківі', 'хліб', 'кавун', 'яблука', 'банани']

print(sorted_list_words(['яблука', 'банани', 'ківі', 'кавун', 'хліб']))